# Function

In [1]:
def ReadDB(intake, sep=','):
    """
    Reads a CSV, XLSX, XML, JSON, or Parquet file from a specified URL or file path.

    Parameters:
        intake (str): The URL or local file path of the file.
        sep (str): The separator used in CSV files (default is ',').

    Returns:
        DataFrame: The loaded data as a pandas DataFrame, or None if an error occurs.
    """
    try:
        # Determine file type based on extension and read accordingly
        if intake.endswith('.csv'):
            data = pd.read_csv(intake, sep=sep)
        elif intake.endswith('.xlsx'):
            data = pd.read_excel(intake)
        elif intake.endswith('.xml'):
            data = pd.read_xml(intake)
        elif intake.endswith('.json'):
            data = pd.read_json(intake)
        elif intake.endswith('.parquet'):
            data = pd.read_parquet(intake)
        else:
            print("Unsupported file type. Only .csv, .xlsx, .xml, .json, and .parquet files are supported.")
            return None
        return data
    except Exception as e:
        print("An error occurred:", e)
        return None

# Examples

## CSV

In [2]:
# ReadDB(intake = r'../../../Datasets/Testing/test_csv.csv', sep=',')

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

## XLSX

In [3]:
# ReadDB(intake = r'../../../Datasets/Testing/test_xlsx.xlsx')

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

## PARQUET

In [4]:
# ReadDB(intake = r'../../../Datasets/Testing/test_parquet.parquet')

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

## JSON

In [5]:
# ReadDB(intake = r'../../../Datasets/Testing/test_json.json')

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

## XML

In [6]:
# ReadDB(intake = r'../../../Datasets/Testing/test_xml.xml')

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago